qmk/qmk_firmware/tmk_core/protocol/arm_atsam/usb/udi_hid_kbd.c
bool udi_hid_nkro_enable(void);
void udi_hid_nkro_disable(void);
bool udi_hid_nkro_setup(void);
uint8_t udi_hid_nkro_getsetting(void);

UDC_DESC_STORAGE udi_api_t udi_api_hid_nkro = {
	.enable = (bool(*)(void))udi_hid_nkro_enable,
	.disable = (void (*)(void))udi_hid_nkro_disable,
	.setup = (bool(*)(void))udi_hid_nkro_setup,
	.getsetting = (uint8_t(*)(void))udi_hid_nkro_getsetting,
	.sof_notify = NULL,
};

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_nkro_rate;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_nkro_protocol;

COMPILER_WORD_ALIGNED
uint8_t udi_hid_nkro_report_set;

bool udi_hid_nkro_b_report_valid;

COMPILER_WORD_ALIGNED
uint8_t udi_hid_nkro_report[UDI_HID_NKRO_REPORT_SIZE];

static bool udi_hid_nkro_b_report_trans_ongoing;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_nkro_report_trans[UDI_HID_NKRO_REPORT_SIZE];

COMPILER_WORD_ALIGNED
UDC_DESC_STORAGE udi_hid_nkro_report_desc_t udi_hid_nkro_report_desc = {
    {
        0x05, 0x01,     // Usage Page (Generic Desktop),
        0x09, 0x06,     // Usage (Keyboard),
        0xA1, 0x01,     // Collection (Application) - Keyboard,

        //Mods
        0x75, 0x01,     //   Report Size (1),
        0x95, 0x08,     //   Report Count (8),
        0x15, 0x00,     //   Logical Minimum (0),
        0x25, 0x01,     //   Logical Maximum (1),
        0x05, 0x07,     //   Usage Page (Key Codes),
        0x19, 0xE0,     //   Usage Minimum (224),
        0x29, 0xE7,     //   Usage Maximum (231),
        0x81, 0x02,     //   Input (Data, Variable, Absolute),

        //LED Report
        0x75, 0x01,     //   Report Size (1),
        0x95, 0x05,     //   Report Count (5),
        0x05, 0x08,     //   Usage Page (LEDs),
        0x19, 0x01,     //   Usage Minimum (1),
        0x29, 0x05,     //   Usage Maximum (5),
        0x91, 0x02,     //   Output (Data, Variable, Absolute),

        //LED Report Padding
        0x75, 0x03,     //   Report Size (3),
        0x95, 0x01,     //   Report Count (1),
        0x91, 0x03,     //   Output (Constant),

        //Main keys
        0x75, 0x01,     //   Report Size (1),
        0x95, 0xF8,     //   Report Count (248),
        0x15, 0x00,     //   Logical Minimum (0),
        0x25, 0x01,     //   Logical Maximum (1),
        0x05, 0x07,     //   Usage Page (Key Codes),
        0x19, 0x00,     //   Usage Minimum (0),
        0x29, 0xF7,     //   Usage Maximum (247),
        0x81, 0x02,     //   Input (Data, Variable, Absolute, Bitfield),
        0xc0,           // End Collection - Keyboard
    }
};

static bool udi_hid_nkro_setreport(void);
static void udi_hid_nkro_setreport_valid(void);
static void udi_hid_nkro_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep);

bool udi_hid_nkro_enable(void)
{
	// Initialize internal values
	udi_hid_nkro_rate = 0;
	udi_hid_nkro_protocol = 0;
	udi_hid_nkro_b_report_trans_ongoing = false;
	memset(udi_hid_nkro_report, 0, UDI_HID_NKRO_REPORT_SIZE);
	udi_hid_nkro_b_report_valid = false;
	return UDI_HID_NKRO_ENABLE_EXT();
}

void udi_hid_nkro_disable(void)
{
	UDI_HID_NKRO_DISABLE_EXT();
}

bool udi_hid_nkro_setup(void)
{
	return udi_hid_setup(&udi_hid_nkro_rate,
								&udi_hid_nkro_protocol,
								(uint8_t *) &udi_hid_nkro_report_desc,
								udi_hid_nkro_setreport);
}

uint8_t udi_hid_nkro_getsetting(void)
{
	return 0;
}

//keyboard receives LED report here
static bool udi_hid_nkro_setreport(void)
{
	if ((USB_HID_REPORT_TYPE_OUTPUT == (udd_g_ctrlreq.req.wValue >> 8))
			&& (0 == (0xFF & udd_g_ctrlreq.req.wValue))
			&& (1 == udd_g_ctrlreq.req.wLength)) {
		// Report OUT type on report ID 0 from USB Host
		udd_g_ctrlreq.payload = &udi_hid_nkro_report_set;
		udd_g_ctrlreq.callback = udi_hid_nkro_setreport_valid; //must call routine to transform setreport to LED state
		udd_g_ctrlreq.payload_size = 1;
		return true;
	}
	return false;
}

bool udi_hid_nkro_send_report(void)
{
	if (udi_hid_nkro_b_report_trans_ongoing)
		return false;

	memcpy(udi_hid_nkro_report_trans, udi_hid_nkro_report,UDI_HID_NKRO_REPORT_SIZE);
	udi_hid_nkro_b_report_valid = false;
	udi_hid_nkro_b_report_trans_ongoing =
			udd_ep_run(	UDI_HID_NKRO_EP_IN | USB_EP_DIR_IN,
							false,
							udi_hid_nkro_report_trans,
							UDI_HID_NKRO_REPORT_SIZE,
							udi_hid_nkro_report_sent);
	return udi_hid_nkro_b_report_trans_ongoing;
}

static void udi_hid_nkro_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep)
{
	UNUSED(status);
	UNUSED(nb_sent);
	UNUSED(ep);
	udi_hid_nkro_b_report_trans_ongoing = false;
	if (udi_hid_nkro_b_report_valid) {
		udi_hid_nkro_send_report();
	}
}

static void udi_hid_nkro_setreport_valid(void)
{
    //UDI_HID_NKRO_CHANGE_LED(udi_hid_nkro_report_set.report_data);
    //modify LEDs received from host here
}

#endif //NKRO

//********************************************************************************************
// EXK (extra-keys) SYS-CTRL  Keyboard
//********************************************************************************************
#ifdef EXK

bool udi_hid_exk_enable(void);
void udi_hid_exk_disable(void);
bool udi_hid_exk_setup(void);
uint8_t udi_hid_exk_getsetting(void);

UDC_DESC_STORAGE udi_api_t udi_api_hid_exk = {
	.enable = (bool(*)(void))udi_hid_exk_enable,
	.disable = (void (*)(void))udi_hid_exk_disable,
	.setup = (bool(*)(void))udi_hid_exk_setup,
	.getsetting = (uint8_t(*)(void))udi_hid_exk_getsetting,
	.sof_notify = NULL,
};

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_exk_rate;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_exk_protocol;

//COMPILER_WORD_ALIGNED
//udi_hid_exk_report_set_t udi_hid_exk_report_set; //No set report

bool udi_hid_exk_b_report_valid;

COMPILER_WORD_ALIGNED
udi_hid_exk_report_t udi_hid_exk_report;

static bool udi_hid_exk_b_report_trans_ongoing;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_exk_report_trans[3];//sizeof(udi_hid_exk_report_t)];

COMPILER_WORD_ALIGNED
UDC_DESC_STORAGE udi_hid_exk_report_desc_t udi_hid_exk_report_desc = {
    {
        // System Control Collection (8 bits)
        
        0x05, 0x01,         // Usage Page (Generic Desktop),
        0x09, 0x80,         // Usage (System Control),
        0xA1, 0x01,         // Collection (Application),
        0x85, 0x02,         //   Report ID (2) (System),
        0x16, 0x01, 0x00,   //   Logical Minimum (1),
        0x26, 0x03, 0x00,   //   Logical Maximum (3),
        0x1A, 0x81, 0x00,   //   Usage Minimum (81) (System Power Down),
        0x2A, 0x83, 0x00,   //   Usage Maximum (83) (System Wake Up),
        0x75, 0x10,         //   Report Size (16),
        0x95, 0x01,         //   Report Count (1),
        0x81, 0x00,         //   Input (Data, Array),
        0xC0,               // End Collection - System Control
        
        // Consumer Control Collection - Media Keys (16 bits)
        
        0x05, 0x0C,         // Usage Page (Consumer),
        0x09, 0x01,         // Usage (Consumer Control),
        0xA1, 0x01,         // Collection (Application),
        0x85, 0x03,         //   Report ID (3) (Consumer),
        0x16, 0x01, 0x00,   //   Logical Minimum (1),
        0x26, 0x9C, 0x02,   //   Logical Maximum (668),
        0x1A, 0x01, 0x00,   //   Usage Minimum (1),
        0x2A, 0x9C, 0x02,   //   Usage Maximum (668),
        0x75, 0x10,         //   Report Size (16),
        0x95, 0x01,         //   Report Count (1),
        0x81, 0x00,         //   Input (Data, Array),
        0xC0,               // End Collection - Consumer Control
    }
};

//COMPILER_WORD_ALIGNED
//UDC_DESC_STORAGE udi_hid_exk_report_desc_t udi_hid_exk_report_desc = {
//    {
//        // System Control Collection (8 bits)
//        //
//        // NOTES:
//        // Using a 1KRO scheme
//        0x05, 0x01,         // Usage Page (Generic Desktop),
//        0x09, 0x80,         // Usage (System Control),
//        0xA1, 0x01,         // Collection (Application),
//        0x85, 0x01,         //   Report ID (1),
//        0x75, 0x08,         //   Report Size (8),
//        0x95, 0x01,         //   Report Count (1),
//        0x16, 0x81, 0x00,   //   Logical Minimum (129),
//        0x26, 0xB7, 0x00,   //   Logical Maximum (183),
//        0x19, 0x81,         //   Usage Minimum (129),
//        0x29, 0xB7,         //   Usage Maximum (183),
//        0x81, 0x00,         //   Input (Data, Array),
//        0xc0,               // End Collection - System Control
//        // Consumer Control Collection - Media Keys (16 bits)
//        //
//        // NOTES:
//        // Using a 1KRO scheme
//        0x05, 0x0c,         // Usage Page (Consumer),
//        0x09, 0x01,         // Usage (Consumer Control),
//        0xA1, 0x01,         // Collection (Application),
//        0x85, 0x02,         //   Report ID (2),
//        0x75, 0x10,         //   Report Size (16),
//        0x95, 0x01,         //   Report Count (1),
//        0x16, 0x01, 0x00,   //   Logical Minimum (1),
//        0x26, 0x9D, 0x02,   //   Logical Maximum (669),
//        0x05, 0x0C,         //   Usage Page (Consumer),
//        0x19, 0x01,         //   Usage Minimum (1),
//        0x2A, 0x9D, 0x02,   //   Usage Maximum (669),
//        0x81, 0x00,         //   Input (Data, Array),
//        0xc0,               // End Collection - Consumer Control
//    }
//};

