qmk/qmk_firmware/tmk_core/protocol/arm_atsam/usb/udi_hid_kbd.c
static void udi_hid_exk_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep);

bool udi_hid_exk_enable(void)
{
	// Initialize internal values
	udi_hid_exk_rate = 0;
	udi_hid_exk_protocol = 0;
	udi_hid_exk_b_report_trans_ongoing = false;
	memset(udi_hid_exk_report.raw, 0, 3);//UDI_HID_EXK_REPORT_SIZE_MAX);
	udi_hid_exk_b_report_valid = false;
	return UDI_HID_EXK_ENABLE_EXT();
}

void udi_hid_exk_disable(void)
{
	UDI_HID_EXK_DISABLE_EXT();
}

bool udi_hid_exk_setup(void)
{
	return udi_hid_setup(&udi_hid_exk_rate,
								&udi_hid_exk_protocol,
								(uint8_t *) &udi_hid_exk_report_desc,
								NULL); // no set_report for EXK
}

uint8_t udi_hid_exk_getsetting(void)
{
	return 0;
}

//const uint8_t udi_hid_exk_data_size[2] = {1, 2};
//const uint8_t udi_hid_exk_report_size[2] = {2, 3}; //has report ID

bool udi_hid_exk_send_report(void)
{
	if (udi_hid_exk_b_report_trans_ongoing)
		return false;

	memcpy(udi_hid_exk_report_trans, udi_hid_exk_report.raw, 3);//udi_hid_exk_data_size[udi_hid_exk_report.desc.report_id]);
	udi_hid_exk_b_report_valid = false;
	udi_hid_exk_b_report_trans_ongoing =
			udd_ep_run(	UDI_HID_EXK_EP_IN | USB_EP_DIR_IN,
							false,
							udi_hid_exk_report_trans,
							3,//udi_hid_exk_report_size[udi_hid_exk_report.desc.report_id],
							udi_hid_exk_report_sent);
	return udi_hid_exk_b_report_trans_ongoing;
}

static void udi_hid_exk_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep)
{
	UNUSED(status);
	UNUSED(nb_sent);
	UNUSED(ep);
	udi_hid_exk_b_report_trans_ongoing = false;
	if (udi_hid_exk_b_report_valid) {
		udi_hid_exk_send_report();
	}
}

#endif //EXK

//********************************************************************************************
// MOU Mouse
//********************************************************************************************
#ifdef MOU

bool udi_hid_mou_enable(void);
void udi_hid_mou_disable(void);
bool udi_hid_mou_setup(void);
uint8_t udi_hid_mou_getsetting(void);

UDC_DESC_STORAGE udi_api_t udi_api_hid_mou = {
	.enable = (bool(*)(void))udi_hid_mou_enable,
	.disable = (void (*)(void))udi_hid_mou_disable,
	.setup = (bool(*)(void))udi_hid_mou_setup,
	.getsetting = (uint8_t(*)(void))udi_hid_mou_getsetting,
	.sof_notify = NULL,
};

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_mou_rate;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_mou_protocol;

//COMPILER_WORD_ALIGNED
//uint8_t udi_hid_mou_report_set; //No set report

bool udi_hid_mou_b_report_valid;

COMPILER_WORD_ALIGNED
uint8_t udi_hid_mou_report[UDI_HID_MOU_REPORT_SIZE];

static bool udi_hid_mou_b_report_trans_ongoing;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_mou_report_trans[UDI_HID_MOU_REPORT_SIZE];

COMPILER_WORD_ALIGNED
UDC_DESC_STORAGE udi_hid_mou_report_desc_t udi_hid_mou_report_desc = {
    {
        0x05, 0x01,         // Usage Page (Generic Desktop),
        0x09, 0x02,         // Usage (Mouse),
        0xA1, 0x01,         // Collection (Application),
        0x09, 0x01,         //   Usage (Pointer),
        0xA1, 0x00,         //   Collection (Physical),
        0x05, 0x09,         //     Usage Page (Buttons),
        0x19, 0x01,         //     Usage Minimum (01),
        0x29, 0x05,         //     Usage Maximun (05),
        0x15, 0x00,         //     Logical Minimum (0),
        0x25, 0x01,         //     Logical Maximum (1),
        0x95, 0x05,         //     Report Count (5),
        0x75, 0x01,         //     Report Size (1),
        0x81, 0x02,         //     Input (Data, Variable, Absolute), ;5 button bits
        0x95, 0x01,         //     Report Count (1),
        0x75, 0x03,         //     Report Size (3),
        0x81, 0x01,         //     Input (Constant), ;3 bit padding,

        0x05, 0x01,         //     Usage Page (Generic Desktop),
        0x09, 0x30,         //     Usage (X),
        0x09, 0x31,         //     Usage (Y),
        0x15, 0x81,         //     Logical Minimum (-127),
        0x25, 0x7F,         //     Logical Maximum (127),
        0x95, 0x02,         //     Report Count (2),
        0x75, 0x08,         //     Report Size (8),
        0x81, 0x06,         //     Input (Data, Variable, Relative), ;2 position bytes (X & Y),

        0x09, 0x38,         //     Usage (Wheel),
        0x15, 0x81,         //     Logical Minimum (-127),
        0x25, 0x7F,         //     Logical Maximum (127),
        0x95, 0x01,         //     Report Count (1),
        0x75, 0x08,         //     Report Size (8),
        0x81, 0x06,         //     Input (Data, Variable, Relative),

        0x05, 0x0C,         //     Usage Page (Consumer),
        0x0A, 0x38, 0x02,   //     Usage (AC Pan (Horizontal wheel)),
        0x15, 0x81,         //     Logical Minimum (-127),
        0x25, 0x7F,         //     Logical Maximum (127),
        0x95, 0x01,         //     Report Count (1),
        0x75, 0x08,         //     Report Size (8),
        0x81, 0x06,         //     Input (Data, Variable, Relative),

        0xC0,               //   End Collection,
        0xC0,               // End Collection
    }
};

static void udi_hid_mou_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep);

bool udi_hid_mou_enable(void)
{
	// Initialize internal values
	udi_hid_mou_rate = 0;
	udi_hid_mou_protocol = 0;
	udi_hid_mou_b_report_trans_ongoing = false;
	memset(udi_hid_mou_report, 0, UDI_HID_MOU_REPORT_SIZE);
	udi_hid_mou_b_report_valid = false;
	return UDI_HID_MOU_ENABLE_EXT();
}

void udi_hid_mou_disable(void)
{
	UDI_HID_MOU_DISABLE_EXT();
}

bool udi_hid_mou_setup(void)
{
	return udi_hid_setup(&udi_hid_mou_rate,
								&udi_hid_mou_protocol,
								(uint8_t *) &udi_hid_mou_report_desc,
								NULL);
}

uint8_t udi_hid_mou_getsetting(void)
{
	return 0;
}

bool udi_hid_mou_send_report(void)
{
	if (udi_hid_mou_b_report_trans_ongoing)
		return false;

	memcpy(udi_hid_mou_report_trans, udi_hid_mou_report, UDI_HID_MOU_REPORT_SIZE);
	udi_hid_mou_b_report_valid = false;
	udi_hid_mou_b_report_trans_ongoing =
			udd_ep_run(	UDI_HID_MOU_EP_IN | USB_EP_DIR_IN,
							false,
							udi_hid_mou_report_trans,
							UDI_HID_MOU_REPORT_SIZE,
							udi_hid_mou_report_sent);
	return udi_hid_mou_b_report_trans_ongoing;
}

static void udi_hid_mou_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep)
{
	UNUSED(status);
	UNUSED(nb_sent);
	UNUSED(ep);
	udi_hid_mou_b_report_trans_ongoing = false;
	if (udi_hid_mou_b_report_valid) {
		udi_hid_mou_send_report();
	}
}

